{
    "format": "layers-model",
    "generatedBy": "keras v3.5.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
      "keras_version": "3.5.0",
      "backend": "tensorflow",
      "model_config": {
        "class_name": "Sequential",
        "config": {
          "name": "sequential",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "layers": [
            {
              "class_name": "InputLayer",
              "config": {
                "inputShape": [3],  
                "dtype": "float32",
                "sparse": false,
                "name": "input_layer"
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "units": 128,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": {
                  "module": "keras.regularizers",
                  "class_name": "L1L2",
                  "config": {
                    "l1": 0.001,
                    "l2": 0.001
                  },
                  "registered_name": null
                }
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "rate": 0.2
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_1",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "units": 64,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": {
                  "module": "keras.regularizers",
                  "class_name": "L1L2",
                  "config": {
                    "l1": 0.001,
                    "l2": 0.001
                  },
                  "registered_name": null
                }
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout_1",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "rate": 0.2
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_2",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  },
                  "registered_name": null
                },
                "units": 1,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                }
              }
            }
          ]
        }
      },
      "training_config": {
        "loss": "mse",
        "metrics": ["mae"],
        "optimizer_config": {
          "class_name": "Adam",
          "config": {
            "name": "adam",
            "learning_rate": 9.999999747378752e-06,
            "beta_1": 0.9,
            "beta_2": 0.999,
            "epsilon": 1e-07
          }
        }
      },
      "weightsManifest": [
        {
          "paths": ["group1-shard1of1.bin"],
          "weights": [
            {
              "name": "sequential/dense/kernel",
              "shape": [4, 128],
              "dtype": "float32"
            },
            {
              "name": "sequential/dense/bias",
              "shape": [128],
              "dtype": "float32"
            },
            {
              "name": "sequential/dense_1/kernel",
              "shape": [128, 64],
              "dtype": "float32"
            },
            {
              "name": "sequential/dense_1/bias",
              "shape": [64],
              "dtype": "float32"
            },
            {
              "name": "sequential/dense_2/kernel",
              "shape": [64, 1],
              "dtype": "float32"
            },
            {
              "name": "sequential/dense_2/bias",
              "shape": [1],
              "dtype": "float32"
            }
          ]
        }
      ]
    }
  }
  